In [1]:
import numpy as np 
import pandas as pd

In [28]:
data= {'Name':['Shah','Vats','Vats','Kumar','Vats','Kumar','Shah','Shah','Kumar','Vats'],
       'Gender':['M','M','F','F','F','M','M','F','F','M'],
       'MonthlyIncome':[114000.00,65000.00,43150.00,69500.00,155000.00,103000.00,55000.00,112400.00,81030.00,71900.00]}
df=pd.DataFrame(data)
df

    Name Gender  MonthlyIncome
0   Shah      M       114000.0
1   Vats      M        65000.0
2   Vats      F        43150.0
3  Kumar      F        69500.0
4   Vats      F       155000.0
5  Kumar      M       103000.0
6   Shah      M        55000.0
7   Shah      F       112400.0
8  Kumar      F        81030.0
9   Vats      M        71900.0

a. Calculate and display familywise gross monthly income

In [30]:
df.groupby('Name')['MonthlyIncome'].sum()

Name
Kumar    253530.0
Shah     281400.0
Vats     335050.0
Name: MonthlyIncome, dtype: float64

b. Calculate and display the member with the highest monthly income in a family

In [31]:
df.groupby('Name')['MonthlyIncome'].max()

Name
Kumar    103000.0
Shah     114000.0
Vats     155000.0
Name: MonthlyIncome, dtype: float64

c. Calculate and display monthly income of all members with income greater than Rs. 60000.00

In [32]:
df[df['MonthlyIncome']>60000.00]

    Name Gender  MonthlyIncome
0   Shah      M       114000.0
1   Vats      M        65000.0
3  Kumar      F        69500.0
4   Vats      F       155000.0
5  Kumar      M       103000.0
7   Shah      F       112400.0
8  Kumar      F        81030.0
9   Vats      M        71900.0

d. Calculate and display the average monthly income of the female members in the Shah family

In [33]:
Shah=df[df['Name']=='Shah']
Shah[Shah['Gender']=='F'].mean()

<ipython-input-33-16961326188f>:2: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  Shah[Shah['Gender']=='F'].mean()

MonthlyIncome    112400.0
dtype: float64